app/views/home/index.html.erb

<%= Signature.order("rand()").first.body %>
---
SELECT `signatures`.* FROM `signatures` ORDER BY rand() LIMIT 1