app/controllers/signatures_controller.rb

  def show
    @signature = Signature.find(params[:id])
---
SELECT `signatures`.* FROM `signatures` WHERE (`signatures`.`id` = 1) LIMIT 1

  def create
    @signature = Signature.new(params[:signature])
    #flash[:notice] = "添加成功！" if @signature.save
    respond_to do |format|
      if @signature.save
---
INSERT INTO `signatures` (`rank`, `body`, `updated_at`, `created_at`) VALUES (0, '看见条推「女孩问男孩: ABCDEFG是什么意思啊？ 男孩回答: A boy can do everything for girl!」其实是ABCDEFGHIJK，A boy can do everything for girl! Haha I\'m Just Kidding.', '2010-12-25 14:31:44', '2010-12-25 14:31:44')